bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G491xx.svd
            <register>
               <name>CFSR_UFSR_BFSR_MMFSR</name>
               <displayName>CFSR_UFSR_BFSR_MMFSR</displayName>
               <description>Configurable fault status           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IACCVIOL</name>
                     <description>Instruction access violation               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUNSTKERR</name>
                     <description>Memory manager fault on unstacking for a               return from exception</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTKERR</name>
                     <description>Memory manager fault on stacking for               exception entry.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MLSPERR</name>
                     <description>MLSPERR</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MMARVALID</name>
                     <description>Memory Management Fault Address Register               (MMAR) valid flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBUSERR</name>
                     <description>Instruction bus error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRECISERR</name>
                     <description>Precise data bus error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IMPRECISERR</name>
                     <description>Imprecise data bus error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNSTKERR</name>
                     <description>Bus fault on unstacking for a return               from exception</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STKERR</name>
                     <description>Bus fault on stacking for exception               entry</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSPERR</name>
                     <description>Bus fault on floating-point lazy state               preservation</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BFARVALID</name>
                     <description>Bus Fault Address Register (BFAR) valid               flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEFINSTR</name>
                     <description>Undefined instruction usage               fault</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVSTATE</name>
                     <description>Invalid state usage fault</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVPC</name>
                     <description>Invalid PC load usage               fault</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOCP</name>
                     <description>No coprocessor usage               fault.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNALIGNED</name>
                     <description>Unaligned access usage               fault</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIVBYZERO</name>
                     <description>Divide by zero usage fault</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HFSR</name>
               <displayName>HFSR</displayName>
               <description>Hard fault status register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VECTTBL</name>
                     <description>Vector table hard fault</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCED</name>
                     <description>Forced hard fault</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBUG_VT</name>
                     <description>Reserved for Debug use</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMFAR</name>
               <displayName>MMFAR</displayName>
               <description>Memory management fault address           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MMFAR</name>
                     <description>Memory management fault               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFAR</name>
               <displayName>BFAR</displayName>
               <description>Bus fault address register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFAR</name>
                     <description>Bus fault address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFSR</name>
               <displayName>AFSR</displayName>
               <description>Auxiliary fault status           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IMPDEF</name>
                     <description>Implementation defined</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
