bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G491xx.svd
            <register>
               <name>XIDAM</name>
               <displayName>XIDAM</displayName>
               <description>FDCAN Extended ID and Mask   Register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x1FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>EIDM</name>
                     <description>EIDM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPMS</name>
               <displayName>HPMS</displayName>
               <description>This register is updated every time a    Message ID filter element configured to generate a    priority event match. This can be used to monitor the    status of incoming high priority messages and to enable           fast access to these messages.</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BIDX</name>
                     <description>BIDX</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>MSI</name>
                     <description>MSI</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FIDX</name>
                     <description>FIDX</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FLST</name>
                     <description>FLST</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF0S</name>
               <displayName>RXF0S</displayName>
               <description>FDCAN Rx FIFO 0 Status Register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0FL</name>
                     <description>F0FL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>F0GI</name>
                     <description>F0GI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>F0PI</name>
                     <description>F0PI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>F0F</name>
                     <description>F0F</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0L</name>
                     <description>RF0L</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF0A</name>
               <displayName>RXF0A</displayName>
               <description>CAN Rx FIFO 0 Acknowledge Register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0AI</name>
                     <description>F0AI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1S</name>
               <displayName>RXF1S</displayName>
               <description>FDCAN Rx FIFO 1 Status  Register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1FL</name>
                     <description>F1FL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>F1GI</name>
                     <description>F1GI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>F1PI</name>
                     <description>F1PI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>F1F</name>
                     <description>F1F</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>RF1L</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1A</name>
               <displayName>RXF1A</displayName>
               <description>FDCAN Rx FIFO 1 Acknowledge Register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1AI</name>
                     <description>F1AI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBC</name>
               <displayName>TXBC</displayName>
               <description>FDCAN Tx Buffer Configuration  Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>                
                  <field>
                     <name>TFQM</name>
                     <description>TFQM</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field> 
               </fields>
            </register>
            <register>
               <name>TXFQS</name>
               <displayName>TXFQS</displayName>
               <description>The Tx FIFO/Queue status is related to the    pending Tx requests listed in register TXBRP. Therefore     the effect of Add/Cancellation requests may be delayed   due to a running Tx scan (TXBRP not yet           updated).</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>TFFL</name>
                     <description>TFFL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TFGI</name>
                     <description>TFGI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TFQPI</name>
                     <description>TFQPI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TFQF</name>
                     <description>TFQF</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBRP</name>
               <displayName>TXBRP</displayName>
               <description>FDCAN Tx Buffer Request Pending           Register</description>
               <addressOffset>0xC8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRP</name>
                     <description>TRP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBAR</name>
               <displayName>TXBAR</displayName>
               <description>FDCAN Tx Buffer Add Request           Register</description>
               <addressOffset>0xCC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AR</name>
                     <description>AR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBCR</name>
               <displayName>TXBCR</displayName>
               <description>FDCAN Tx Buffer Cancellation Request           Register</description>
               <addressOffset>0xD0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CR</name>
                     <description>CR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBTO</name>
               <displayName>TXBTO</displayName>
               <description>FDCAN Tx Buffer Transmission Occurred           Register</description>
               <addressOffset>0xD4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TO</name>
                     <description>TO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBCF</name>
               <displayName>TXBCF</displayName>
               <description>FDCAN Tx Buffer Cancellation Finished           Register</description>
               <addressOffset>0xD8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CF</name>
                     <description>CF</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBTIE</name>
               <displayName>TXBTIE</displayName>
               <description>FDCAN Tx Buffer Transmission Interrupt           Enable Register</description>
               <addressOffset>0xDC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIE</name>
                     <description>TIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBCIE</name>
               <displayName>TXBCIE</displayName>
               <description>FDCAN Tx Buffer Cancellation Finished           Interrupt Enable Register</description>
               <addressOffset>0xE0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFIE</name>
                     <description>CFIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXEFS</name>
               <displayName>TXEFS</displayName>
               <description>FDCAN Tx Event FIFO Status           Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EFFL</name>
                     <description>EFFL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EFGI</name>
                     <description>EFGI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EFPI</name>
                     <description>EFPI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EFF</name>
                     <description>EFF</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFL</name>
                     <description>TEFL</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXEFA</name>
               <displayName>TXEFA</displayName>
               <description>FDCAN Tx Event FIFO Acknowledge           Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EFAI</name>
                     <description>EFAI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CKDIV</name>
               <displayName>CKDIV</displayName>
               <description>FDCAN CFG clock divider           register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PDIV</name>
                     <description>input clock divider. the APB clock could               be divided prior to be used by the CAN               sub</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
